{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 400]}, "class_name": "InputLayer"}, {"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 400]}, "class_name": "InputLayer"}, {"name": "embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "embedding_1", "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 400], "input_dim": 10000, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 400, "activity_regularizer": null, "trainable": true, "output_dim": 32}, "class_name": "Embedding"}, {"name": "embedding_2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "embedding_2", "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 400], "input_dim": 16864, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 400, "activity_regularizer": null, "trainable": true, "output_dim": 32}, "class_name": "Embedding"}, {"name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_constraint": null, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "dropout": 0.2, "return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"name": "lstm_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_constraint": null, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_2", "dropout": 0.2, "return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"name": "lstm_3", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_constraint": null, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_3", "dropout": 0.5, "return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"name": "lstm_4", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_constraint": null, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_4", "dropout": 0.5, "return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, {"name": "concatenate_1", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_4", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"name": "bidirectional_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"layer": {"config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "bias_constraint": null, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_5", "dropout": 0.2, "return_state": false, "activation": "tanh", "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_1"}, "class_name": "Bidirectional"}, {"name": "flatten_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "name": "dense_2", "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "name": "dense_1", "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0], ["dense_1", 0, 0]]}, "class_name": "Model"}