{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"input_dim": 10000, "embeddings_constraint": null, "input_length": 400, "dtype": "float32", "batch_input_shape": [null, 400], "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "output_dim": 32, "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1"}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "unroll": false, "recurrent_dropout": 0.2, "go_backwards": false, "trainable": true, "kernel_regularizer": null, "use_bias": true, "unit_forget_bias": true, "name": "lstm_1", "bias_constraint": null, "return_state": false, "units": 100, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 1, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null}}], "name": "sequential_1"}, "class_name": "Sequential"}