{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 1, 100], "sparse": false}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1, 400], "sparse": false}, "inbound_nodes": []}, {"name": "dense_sentiment1", "class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_sentiment1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_imdb1", "class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_imdb1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_sentiment1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_imdb1", 0, 0, {}]]]}, {"name": "dense_sentiment2", "class_name": "Dense", "config": {"units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_sentiment2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_imdb2", "class_name": "Dense", "config": {"units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_imdb2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["dense_sentiment2", 0, 0, {}], ["dense_imdb2", 0, 0, {}]]]}, {"name": "dense_shared1", "class_name": "Dense", "config": {"units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_shared1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_shared1", 0, 0, {}]]]}, {"name": "dense_shared2", "class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_shared2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_shared2", 0, 0, {}]]]}, {"name": "dense_shared3", "class_name": "Dense", "config": {"units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_shared3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dense_shared3", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]]}}