{"config": {"layers": [{"config": {"activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "output_dim": 32, "input_length": 400, "dtype": "float32", "input_dim": 16864, "trainable": true, "name": "embedding_1", "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 400], "embeddings_regularizer": null}, "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "return_sequences": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "recurrent_dropout": 0.2, "go_backwards": false, "implementation": 1, "use_bias": true, "dropout": 0.2, "unit_forget_bias": true, "bias_constraint": null, "activation": "tanh", "stateful": false, "unroll": false, "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "units": 100, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 1}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}